src/InformationRegisters/ЦеныНоменклатуры/ЦеныНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныНоменклатуры</name>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПрайсЛистТовара</name>
    <type>
      <types>EnumRef.ПрайсЛистТовара</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЕдИзмеренеия</name>
    <type>
      <types>CatalogRef.БазовыеЕдиницыИзмерения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/CommonModules/РаботаСДокументамиСервер/Module.bsl
#Область СлужебныеПроцедурыИФункции

Функция ПолучитьДанныеНоменклатуры(Номенклатура, ПрайсЛистНоменклатуры) Экспорт
	
	Данные = Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЦеныНоменклатуры.Цена КАК Цена,
		|	ЦеныНоменклатуры.ЕдИзмеренеия КАК ЕдИзмеренеия
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
		|ГДЕ
		|	ЦеныНоменклатуры.Номенклатура = &Номенклатура
		|	И ЦеныНоменклатуры.ПрайсЛистТовара = &ПрайсЛистНоменклатуры";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("ПрайсЛистНоменклатуры", ПрайсЛистНоменклатуры);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл

		Данные.Вставить("Цена", 	    Выборка.Цена); 
		Данные.Вставить("ЕдИзмеренеия", Выборка.ЕдИзмеренеия);

	КонецЦикла;
	
	Возврат Данные;
	
КонецФункции

Функция ВедётЛиОрганизацияУчётСклада(Организация) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Организации.ВестиУчётПоСкладам
		|ИЗ
		|	Справочник.Организации КАК Организации
		|ГДЕ
		|	Организации.Ссылка = &Организация";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();

	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.ВестиУчётПоСкладам;
	КонецЦикла;

КонецФункции

#КонецОбласти
